package org.unknown100name.ecommerce;

import org.junit.jupiter.api.Test;
import org.springframework.boot.test.context.SpringBootTest;
import org.unknown100name.ecommerce.dao.CategoryMapper;
import org.unknown100name.ecommerce.dao.ItemMapper;
import org.unknown100name.ecommerce.pojo.dto.CategoryDTO;
import org.unknown100name.ecommerce.pojo.entity.CategoryTwo;
import org.unknown100name.ecommerce.pojo.entity.InnerItem;
import org.unknown100name.ecommerce.pojo.entity.Item;
import org.unknown100name.ecommerce.pojo.vo.InnerItemCreateParam;
import org.unknown100name.ecommerce.pojo.vo.ItemCreateParam;

import javax.annotation.Resource;
import java.math.BigDecimal;
import java.util.*;

/**
 * @author unknown100name
 * @since 2022.03.07
 */
@SpringBootTest
public class DatabaseItemBackupTest {

    @Resource
    private ItemMapper itemMapper;

    @Resource
    private CategoryMapper categoryMapper;

    private final List<Item> itemList = new ArrayList<>();
    private final List<InnerItem> innerItemList = new ArrayList<>();
    private final Map<Long, CategoryTwo> categoryMap = new HashMap<>();

    private Integer nowId = 1;
    private Boolean isNext = false;


    @Test
    public void test(){
        List<CategoryDTO> categoryList = categoryMapper.getCategoryList();
        categoryList.forEach(categoryDTO ->
                categoryDTO.getCategoryTwoList().forEach(
                        categoryTwo -> categoryMap.put(categoryTwo.getCategoryTwoId(), categoryTwo)
                ));

        // 1-20

        addItem("国产白虾 万景北海鲜冻白虾",
                "广西北部湾出产，出口30年企业直供。无冰净重4斤，大规格50/60，体长11-15cm，盐冻工艺可单只拿取，新鲜活冻。北部湾位于中国南海，是一个美丽的海湾。\n",
                new String[]{"国产白虾50/60 2kg","国产白虾40/50 2kg","1kg国产白虾50/60"});

        addItem("【保温箱+冰袋发货】金葵日式裙带菜",
                "【保温箱+冰袋发货】金葵日式裙带菜500g开袋即食下饭菜海藻寿司中华海草沙拉海带梗丝酸甜口味芥末口味 酸甜味500g-冷冻存储",
                new String[]{"酸甜味500g-冷冻存储","芥末味500g-冷冻存储","酸甜味200g*2袋","芥末味200g*2袋"});

        addItem("南翔 上海灌汤小笼包",
                "中华老字号，皮嫩软弹，馅纯味鲜。",
                new String[]{"猪肉小笼包180g*3袋（30只）","黑猪肉小笼包180g*3袋（18只）"});

        addItem("云鼎轩 深海鳕鱼排310g 10个/盒 整块鳕鱼制作 煎油炸小吃 速冻生鲜食",
                "云鼎轩 深海鳕鱼排310g 10个/盒 整块鳕鱼制作 煎油炸小吃 速冻生鲜食品 半成品方便菜 海鲜制品",
                new String[]{"深海鳕鱼排310g【10枚装】","香酥虾排250g【8枚装】","海苔虾饼250g【8枚装】"});

        addItem("良品铺子 东方食力零食大礼包中国风过年囤货年货送礼猪肉脯鸭脖30袋休闲零食网红小吃送亲人礼品礼盒装600g",
                "【良品铺子·女神好礼】高颜好味低至9.9元！！人气美味，专区领神券300减200！！进店抢购！！",
                new String[]{"【12款纯肉礼盒】肉肉礼盒1450g","【16款纯肉礼盒】肉肉狂欢1770g","【8款纯肉礼盒】肉肉大派对1011g","【8荤7素国潮礼】食力满满2027g","【5款荤素】无肉不欢671g","【5款辣条】无辣不欢826g"});

        addItem("Orion 好丽友 休闲零食 薯片 非油炸（新老包装随机发货）",
                "3.7日茶里京东超级品牌日，一杯好茶在茶里，限时抢99-98大额优惠券立即抢购",
                new String[]{"五连罐520g","三连罐104g*3","香烤原味104g","红酒牛排104g","清新番茄104g","蜂蜜牛奶104g"});

        addItem("鲜菓篮水果礼盒生鲜水果年货礼盒 绿心猕猴桃30粒单果70-90g 新鲜水果生鲜",
                "【百亿补贴】19.8元抢5斤耙耙柑大果彩箱装，果园新鲜采摘，甜蜜多汁细嫩",
                new String[]{"丑橘不知火12枚大果水果礼盒橘子水果","春见耙耙柑橘子12粒大果精美水果礼盒","绿心猕猴桃20粒单果110-150g","绿心猕猴桃30粒单果70-90g"});

        addItem("柿子饼500g圆柿饼 平柿新鲜柿子饼 霜降柿饼 500g",
                "",
                new String[]{"柿子饼"});

        addItem("英国进口 麦维他（Mcvitie's）燕麦酥性消化饼干 300g 早餐代餐饼干 春季小食 进口休闲零食",
                "3.7日茶里京东超级品牌日，一杯好茶在茶里，限时抢99-98大额优惠券立即抢购",
                new String[]{"燕麦300g","燕麦300g*2"});

        addItem("唯他可可（Vita Coco）椰子水天然原味清甜椰汁水0脂低卡进口饮料整箱 NFC 椰青果汁",
                "【3.8节囤好物】唯他可可椰子水0脂低卡、含丰富电解质，每满200-20优惠券！抢购中~戳我",
                new String[]{"原味330ml*12","原味500ml*6","菠萝味330ml*12","醇香风味330ml*12","原味罐装310ml*12","原味1L*4"});

        addItem("食月冬初 恩施糍粑手工糯米糍粑火锅食材小吃农家传统糕点特产驴打滚年糕美食红糖糍粑",
                "土家腊后腿肉，限量抢购，3000份售空即止，先到先得川味烟熏腊肉",
                new String[]{"12个3斤左右纯糯米糍粑+红糖豆粉","8个2斤左右纯糯米糍粑","4个1斤左右纯糯米糍粑","20个5斤左右纯糯米糍粑+红糖豆粉"});

        addItem("【广丰助农馆】饶情南昌拌粉 7种配料美味小吃江西米粉干米线螺丝粉土特产炒粉方便食品",
                "里面小料都有足足7包！而且它的粉是螺蛳粉的米粉，很有弹性！很爽滑！购买更多美食请点击",
                new String[]{"南昌拌粉206g*5盒","米粉干4斤","南昌拌粉206g*3盒","红薯粉丝500g","红薯粉丝500g*2袋","江西米粉1斤装","南昌拌粉206g*1盒【每盒里面7包小料】"});

        addItem("雀巢（Nestle）醇品 速溶 黑咖啡 无蔗糖 冲调饮品 焕新升级",
                "3.7日茶里京东超级品牌日，一杯好茶在茶里，限时抢99-98大额优惠券立即抢购",
                new String[]{"醇品黑咖48包","醇品黑咖20包","醇品黑咖50g","醇品黑咖100g","醇品黑咖200g","醇品礼盒"});

        addItem("蒙牛纯甄 常温风味酸牛奶 送礼推荐 200g*24 纯正生牛乳发酵 礼盒装(新老包装随机发货)",
                "3.7日茶里京东超级品牌日，一杯好茶在茶里，限时抢99-98大额优惠券立即抢购",
                new String[]{"【口碑爆款】纯甄原味24盒","【跳跳糖馋酸奶】6杯","【蓝莓果粒】纯甄风味酸奶10盒","【王一博推荐】纯甄黄桃藜麦口味","【草莓果粒】纯甄风味酸奶10盒","【黄桃燕麦】纯甄风味酸奶10盒","【新品上市】纯甄芒芒西柚*10"});

        addItem("大午五香驴肉175g*5袋常温熟食真空老汤卤煮酱驴肉正宗熟驴肉火烧河北特产",
                "京东牛羊肉，全球好味，精挑细选，爆款直降，部分3件7折。好物稀缺，点击速买》》",
                new String[]{"【无礼盒】五香驴肉：175g*5袋","【无礼盒】五香驴肉：200g*4袋","【有礼盒】五香礼盒：175g*4袋","【有礼盒】御品礼盒：175g*6袋","【有礼盒】珍品礼盒：175g*4袋","【有礼盒】福瑞礼盒：175g*6袋"});

        addItem("梅花鹿 桃李旺 梅花鹿肉 现杀新鲜梅花鹿排 新鲜鹿肉 成年梅花鹿生鲜肉类",
                "新鲜现杀品质，有鹿肉，鹿腿，鹿排，鹿头，顺丰发出！",
                new String[]{"【2斤】梅花鹿肉","【5斤】鸵鸟肉","【约10斤】整只梅花鹿腿","【3斤】梅花鹿排","【干鹿鞭/130克】整根礼盒装","【500ml/瓶】纯正鹿茸血酒","【干鹿鞭/80克】整根礼盒装","梅花鹿内脏","【4~5斤】整个母鹿头","【3斤】鸵鸟掌+鸵鸟筋","【5斤】鸵鸟掌+鸵鸟筋","【9~10斤】整个公鹿头"});

        addItem("【贵州珍酒 酒厂自营】珍品整箱53度酱香型白酒500ml*6 纯粮食大曲坤沙 陈年窖藏酒 口粮酒",
                "【三八节】满额享养生酒、燕窝、鱼胶礼盒与周六福金饰；新人可0元入会领20元优惠券可叠加首购礼金享折上折；新品预售末波倒计时，限时享优惠；更多优惠活动请点击查看",
                new String[]{"一件"});

        addItem("卡慕（CAMUS）干邑白兰地 皇冠GMC700ml 法国进口洋酒 礼品",
                "",
                new String[]{"皇冠GMC 700ml","布特妮VSOP 1L","卡慕XO 700ml"});

        addItem("海天 酱油 生抽酱油 中华老字号",
                "元气女神厨房，粮油调味&小家电联合来袭！部分满300减30，厨房好物尽在这里速戳》》",
                new String[]{"鲜味生抽1.9L*6【整箱装】","凉拌生抽500ml","薄盐生抽500ml","鲜味生抽500ml","头道酱油250ml","生抽酱油1.9L"});

        addItem("金龙鱼 东北大米 盘锦大米 5kg 蟹稻共生 大米 粳米 香米 十斤",
                "元气女神厨房，粮油调味&小家电联合来袭！部分满300减30，厨房好物尽在这里速戳》》",
                new String[]{"十斤"});

        addItem("绿食者 新鲜蔬菜沙拉组合3斤 西餐色拉沙拉生菜轻食健身食材配菜",
                "",
                new String[]{"3斤"});

        addItem("旭耕 有机蔬菜8斤套餐 家庭体验当季时令8种净菜 有机认证供港资质 节日礼盒配送 8斤自选套餐",
                "",
                new String[]{"8斤"});

        addItem("天福茗茶 瓷罐大红袍 武夷山特产茶 福建名茶正宗乌龙茶礼盒200g 茶叶送礼长辈",
                "",
                new String[]{"200g","400g","800g"});

        addItem("【买1送1共1斤 不好喝全额退款】修哲无农残茶叶台湾高山茶金萱乌龙 赛过大红袍铁观音 带奶香",
                "不好喝全额退款\\买一送一到手共一斤",
                new String[]{"1斤"});

        addItem("思维导图：文言文满分学习法（涵盖初中生必学文言文35篇，七至九年级通用）",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购",
                new String[]{"思维导图学习法记忆力","思维导图单词记忆法","思维导图作文提升宝典套装3册","思维导图从入门到精通套装3册","思维导图学习法应试力","思维导图学习法学习力","思维导图学习法笔记力","思维导图学习法阅读力","思维导图学习法创造力"});

        addItem("给孩子的语文三书全3册：语文趣味 文章做法 读和写（继刘薰宇《给孩子的数学三书》后的又一部经典",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购",
                new String[]{"给孩子的数学三书","给孩子的语文三书","数学思维秘籍（全10册）","课里名人课外读","给孩子的科学三书","小尼莫梦乡历险记","给孩子读的中国古诗词","中国历代圣贤故事集","给孩子的数学课（全3册）","给孩子的几何四书","写给孩子看的趣味汉字（全6册）"});

        addItem("热爱 天霸BJD娃娃妆造作品集",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购",
                new String[]{"热爱 天霸BJD娃娃妆造","哇！黏土 小小的萌系精灵","巧手姐姐的黏土童话书","巧手姐姐的黏土魔法书","BJD娃娃化妆术全解析","米米酱的黏土手办教程","黏土花 留下花开最美时","黏土花制作完全教程","手工饰品定制技法大全","簪花录 热缩片唯美古风饰品制作","人形玩偶妆容 服装 饰品道具制作"});

        addItem("决胜高中三年关键期（京东专享几何网格本）",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购",
                new String[]{"决胜高中三年关键期"});

        addItem("余华：活着（精装版，余华代表作，易烊千玺推荐阅读 2021新版，随机赠珍藏复刻手稿） ",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购",
                new String[]{"活着（定本·2021版）","余华长篇小说精选集","文城"});

        addItem("围城（精装）",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购",
                new String[]{"围城（精装）","洗澡（杨绛作品 精装）","洗澡（杨绛作品 平装）"});

        addItem("【签名版】遇见幸福 喻丰 著 武汉大学积极心理学知名教授 恋爱心理学课堂爆火 窗户上都挂满人 读懂积极心理学 中信出版社",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购",
                new String[]{"活出心花怒放的人生","强大内心的自我对话","喻丰 遇见幸福"});

        addItem("船山遗书（套装全15册）",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购",
                new String[]{"船山遗书（全15册）","曾文正公家书（全2册）","鲁迅全集 精装（全20册）"});

        addItem("中国传统色1+2（套装共2册）",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购",
                new String[]{"中国传统色1+2","中国传统色 故宫里的色彩美学","中国传统色+日本传统色","中国传统色：色彩通识100讲","中国传统色日历"});

        addItem("【正版包邮】中国传统色 故宫里的色彩美学 郭浩李健明著 黄晓明力荐 中国色彩文化传承",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购",
                new String[]{"1本"});

        addItem("影响力 2021年全新升级版 限量作者签章版?影响力教父罗伯特·西奥迪尼新作",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购查看>",
                new String[]{"影响力（2021全新升级版）","影响力（老版售罄）","签章版 （影响力&福格套装）"});

        addItem("底层逻辑：看清这个世界的底牌 刘润最新力作 2021刘润年度演讲【进化的力量】主推",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购查看>",
                new String[]{"底层逻辑","刘润三部曲","刘润商业书籍套装共2册"});

        addItem("血战长津湖",
                "朝鲜战争拐点之战，足以改变历史进程！",
                new String[]{"1本"});

        addItem("李夕夜，不再沉默",
                "韩国版《房思琪的初恋乐园》女性主义小说代表作；韩国文坛Z高荣誉“万海文学奖”获奖作品；亲爱的女孩，请别再沉默！引发万千女性震撼共鸣！",
                new String[]{"1本"});

        addItem("商界评论",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购查看>",
                new String[]{"（2019年4月号）","预定（2019年5月号）","预定（2019年5月号）"});

        addItem("中国国家地理",
                "",
                new String[]{"（2018年10月号）(本期超值加厚版)","预定（2018年11月号）","预定（2018年12月号）"});

        // 21-40

        addItem("植物学家的野外考察手记 原始森林和洞穴的神奇之旅",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购",
                new String[]{"1本"});

        addItem("给91件未来事物写历史[知乎出品]",
                "奔跑吧！新学期！图书每满100减50,满减叠券享400减250,团购电话4006186622抢购",
                new String[]{"1本"});

        addItem("汽车音乐发烧：金耳朵（5CD）（京东专卖）",
                "赵鹏，区瑞强，龚玥，童丽，刘紫玲 演唱，三木刚 曲",
                new String[]{"1件"});

        addItem("世界最美轻音乐集（限量珍藏版）（10CD）",
                "张璐，肯尼基（KENNY G），宁林，肖乘光，谭炎健 ... 演唱，久石让，萨拉萨蒂，勃拉姆斯，詹姆斯·霍纳 等 曲",
                new String[]{"1件"});

        addItem("微课网高一高二生物必修选修高中在线辅导高考视频课程教程家教学习复习网课课件 0元试听",
                "",
                new String[]{"必修1","必修2","必修3","选修1（部分）","选修3（部分）","选择性必修1"});

        addItem("万门大学 轻松学JavaScript 零基础网课教学视频 在线课程培训试听 java语言程序设置",
                "网络课程为虚拟产品，无实际物流，需咨询客服获取课程激活码，课程有效期为15天，请尽快安排听课。",
                new String[]{"15天"});

        addItem("萌翻了，米尼诺：给孩子的科学启蒙推拉书（套装共4册） 去冲浪、魔法种子、下雨了、上月球 [0-3岁]",
                "低音出品|专为宝宝设计的科学启蒙绘本！4大主题，34种推拉设计，锻炼精细动作和想象力。　团购电话4006186622",
                new String[]{"给孩子的科学启蒙推拉书","萌翻了，米尼诺. 下雨了","萌翻了，米尼诺. 去冲浪","萌翻了，米尼诺. 上月球","萌翻了，米尼诺. 魔法种子","就像我爸爸·妈妈","就像我爸爸","就像我妈妈"});

        addItem("跟我走 3-6岁（启发出品） [2-6岁]",
                "100册以上团购优惠联系电话4006186622",
                new String[]{"（新书）跟我走 儿童自我保护","（二手）跟我走 儿童自我保护"});

        addItem("飞利浦（PHILIPS）CSS5235 音响 音箱 家庭影院 随需环绕 无线蓝牙 电视音响 一秒变影院",
                "",
                new String[]{"10.5kg"});

        addItem("JBL BAR5.1电视回音壁音响家庭影院5.1声道套装音箱客厅无线环绕Soundbar条形蓝牙低音炮",
                "【8日巅峰开抢】爆品直降1600!抢购价:4999!5.1声道,510W强劲功率，HIFI级音效！更多热销电视音响》查看>",
                new String[]{"Bar 5.1(真5.1声道 无线环绕）","STV105升级版(电视好伴侣)","JBL Cinema SB120(新品)","SB170(杜比全景声)","SB190(杜比全景声)","K歌套装(Bar5.1＋点唱机)"});

        addItem("苏泊尔(SUPOR) 抽油烟机 18立方大吸力 经典侧吸式吸油烟机家用 黑晶面板 DJ13 油烟机",
                "【家电3·8节】限时开抢！暖心到手699元！限量100台【下单赠火鸡筷子篓】【18立方近吸速排！黑晶面板一拭即净！琴键易操作】》新7字烟灶套装查看>",
                new String[]{"DJ13+5.0KW不锈钢灶 液化气","DJ13+5.0KW不锈钢灶 天然气","DJ13+5.0KW猛火灶 液化气","DJ13+5.0KW猛火灶 天然气","【经典侧吸】DJ13 单烟机"});

        addItem("美的（Midea） 抽油烟机 侧吸式 17立方大吸力立体环吸多重油烟分离技术家用吸油烟机排烟机抽烟机J30",
                "【家电3·8节】火热抢购中！即刻下单抢惊爆价1099！享免费上门测量！17立方立体环吸！国民品质！库存有限！抢到赚到！》新品抢华为P50查看>",
                new String[]{"油烟机+5.0KW液化气灶","油烟机+5.0KW天燃气灶","油烟机+4.5KW液化气灶","油烟机+4.5KW天燃气灶","【单独购买烟机】"});

        addItem("小天鹅(LittleSwan)10公斤变频滚筒洗衣机全自动 京东小家 纯净系列 健康除螨洗 BLDC变频TG100VT096WDG-Y1T",
                "【领每满200减20元券】今日限时到手不高于1899元 【晒单赠留香去渍洗衣液！赠电机十年包修&3期免息 【咨询客服领优惠！整机三年包修&价保30天免费送装】戳查看>",
                new String[]{"【爆款银离子除菌套装】热泵柔烘","【彩屏巡航除菌】10KG智投款滚筒","【彩屏巡航除菌】10KG智投款洗烘","【巡航除菌】10KG智投款钛色滚筒","【巡航除菌】10KG智投款蒸汽洗烘","【月销千万】10KG银离子除菌滚筒","【金榜认证】10KG银离子纤维柔烘","【镇店推荐】10KG健康除螨滚筒款","【金榜认证】10KG除菌净螨洗烘款"});

        addItem("海尔（Haier)滚筒洗衣机全自动BLDC变频电机10KG大容量高温除菌除螨EG100MATE2S",
                "【元气生活MATE开启】【今日下单立减200元|满2000减300元|到手价不高于1999元】20-21点再赠50元京豆|赠电机10年保修|羽绒洗更蓬松戳查看>",
                new String[]{"【Mate】10KG洗烘套装|香薰热泵","【微蒸汽空气洗】10KG洗烘|银色","【Mate系列】10KG滚筒|行业爆款"});

        addItem("海尔（Haier）安心浴60升电热水器速热大水量金刚无缝胆水质监测健康灭菌WIFI智控一级能效 EC6001-PD3(U1)",
                "【3.8节全面开抢】【下单到手价1149元！】剩余热水量可视化！2200W大功率速热！智能APP操控！【收藏加购咨询客服抽手机大奖】顶配双胆恒温黑科技新品查看>",
                new String[]{"⭐⭐⭐热水器产品全网TOP1","【空间大师】恒温黑科技新品","【3D速热】七星净水洗 健康可视","【3D速热短款】七星净水洗","【3300W变频】镁棒免换 健康可视","【3300W短款】健康可视 玲珑机身","【3000W变频】WIFI智能 健康抑菌","【1750W厨宝5L】一级能效高保温"});

        addItem("美的（Midea）初见套系60升电热水器2100W速热高温健康洗 一级变频无缝内胆京东小家智能生态F6021-JA1(HEY)",
                "【3月8巅峰开抢】【立减到手价不高于1049】咨询客服晒单登记送电水壶【大功率变频一级节能省电】【wifi智控】【双重防漏电】【新品纤薄扁桶首发，抢0元试用】查看>",
                new String[]{"⭐️⭐️⭐️美的热水器全网TOP1","【超级新品】3200W大功率三显","⭐️⭐️⭐️亲肤 电子镁棒美肌","⭐️⭐️⭐️首发 高贵 安装全免"});

        addItem("美的(Midea) 1.5匹空调风酷新一级变频冷暖壁挂式空调挂机大风口 京东小家智能家电 以旧换新KFR-35GW/N8XHC1",
                "【3月8日巅峰开抢】活动到手不高于2799元！省电明星节能升级款！【店铺主推爆款挂机】【升级大风口速享舒适丨WiFi远程智控】点击查看>",
                new String[]{"【大1匹】风酷三级自清洁","【大1匹】风酷新一级大风口","【大1.5匹】风酷新一级大风口"});

        addItem("格力（GREE）1.5匹 云佳 新一级能效 变频冷暖 自清洁 壁挂式空调挂机KFR-35GW/NhGc1B以旧换新",
                "【3月8日巅峰开抢】到手价不高于2999元！【店铺主推爆款机型】【加购指定型号抽好礼】【整机10年包修】以旧换新更优惠！点击查看更多！查看>",
                new String[]{"【大1匹】云佳一级自清洁","【1.5匹】云佳一级自清洁","【大1匹】云佳三级变频","【1.5匹】云佳三级变频","【2匹】云佳三级变频","【3匹】云佳三级变频"});

        addItem("大宇（DAEWOO）挂烫机家用手持蒸汽熨烫机熨衣机旅游出差便携式熨斗HI-029-ZI",
                "【京东38节】5-8号活动开抢，到手349元！半价购熨衣板+晒单20元红包 【0.3s穿透衣物！超强蒸汽，超大面板设计，熨烫更省时！】活动会场查看>\n",
                new String[]{"便携手持熨斗-029紫【爆款】","便携手持熨斗-029白【爆款】","029-熨衣板"});

        addItem("沁园（TRULIVA）京品家电小白鲸旗舰净水器家用2.5升/分钟UV杀菌智能龙头厨下反渗透直饮净水机KRL5018",
                "【3月8日巅峰开抢，到手2899元,享12期免息】下单赠PGP*2，晒单赠CTO*2，晒单前100名赠电烤炉，100后送烤箱》顶配款查看>",
                new String[]{"UV杀菌大流量数显款 2.5升/分钟","屋水路保护800G+FMP308","全屋净饮速热800G+LNW580","全屋净热套装800G+FMP308+LNW580"});

        addItem("飞利浦(PHILIPS) 电动牙刷 成人声波震动牙刷 净力刷 2种模式 温和清洁 白色 HX2431/02",
                "【呵护口腔健康，选飞利浦口腔护理】到手价199元 【限量加赠138元牙刷头+牙刷盒，限前1000名】 【年轻人优选|2种洁齿模式|30天超长续航】价保30天查看>",
                new String[]{"呵护敏感牙龈|2种模式【白】","呵护敏感牙龈|2种模式【深蓝】"});

        addItem("松下（Panasonic）电吹风机 家用 纳诺怡护发 大功率速干 恒温护发 EH-JNA3C 蔡徐坤同款",
                "【3.6-3.8焕新季】【到手价369元，限量1000件，抢完即止】纳诺怡滋养护发，50度恒温护发，价保30天",
                new String[]{"【少女粉】纳米水离子 1800W","【樱花粉】1800W 双风嘴","【紫色】纳米水离子 1600W"});

        addItem("容声(Ronshen)【离子净味系列】536升双变频冰箱双开门对开门家用风冷无霜大容量BCD-536WD18HP超薄节能净味",
                "【女王尝鲜季·年度店铺热销王】追加100名领券省280仅2699【20点起全店前50名返500元E卡相当于2199】410升超薄组合嵌入冰箱上新立省1000查看>",
                new String[]{"【超级爆品】536L净味纤薄变频","【大容量爆款】636L一级能效变频","【纳米补水】645L负离子除菌养鲜","【晶钻热卖】536L全净化干湿分储"});

        addItem("美的(Midea)606升变频一级能效对开双门家用冰箱京东小家智能家电风冷无霜BCD-606WKPZM(E)大容量精细分储",
                "【钜惠女王节】【秒杀特惠到手2999,晒单送三年延保】 【大容量精细分储，双变频节能养鲜，风冷无霜不结冰】 【新品516升法式多门，超大存储空间】查看>",
                new String[]{"【宽911】650升母婴抑菌独立空间","【宽910】601升24H全时除菌净味","【宽910】609升微晶一周鲜","【宽911】606升热卖爆款99%抗菌","【宽835】470升热卖爆款超薄机身"});

        addItem("华凌 洗碗机预约上门测量链接（非实物，详情咨询客服）",
                "",
                new String[]{"免费上门测量"});

        addItem("美的（Midea）15套大容量 嵌入式 骄阳家用洗碗机 热风烘干 银离子净味 双驱变频 智能家电 自动刷碗机",
                "【3月8日巅峰开抢】【到手价不高于4299元】【下单送洗碗粉套装！晒单送挂烫机】【享白条6期免息】【咨询客服享惊喜】一级水效新品上市查看>",
                new String[]{"⭐⭐⭐【RX600】15套变频节能洗","⭐⭐⭐【JV800】16套节能分层洗","⭐⭐⭐⭐⭐【RX600W白】一级水效"});

        addItem("美的（Midea）燃气灶天然气 双灶具 5.0kW大火力 铜火盖 钢玻面板 六年质保 台嵌两用 以旧换新一级能效Q230B",
                "【美的燃气灶特惠-享六年包修】限时24H！满减到手699！美的更美丽！全国联保！5.0kw火力！全进风循环供氧！9档精准大火力！【5.2kW极限火上市查看>",
                new String[]{"行业爆款⭐5.0kW⭐6年质保","⭐⭐智能三防：定时-控温-防干烧","⭐⭐⭐超大猛火 5.2极限猛火"});

        addItem("苏泊尔(SUPOR) 燃气灶双灶 天然气灶双灶具5.0KW家用猛火灶 钢化玻璃双灶台嵌两用 全进风 一级能效 JZT-Q5天",
                "【家电3·8节】限时开抢！暖心到手629元！库存有限！百万口碑优选【5.0KW爆炒烈焰猛火灶！全方位立体进风】70%热效率新品灶查看>",
                new String[]{"【销量王者】5.0KW大火力 Q5-液","【销量王者】5.0KW大火力 Q5-天"});

        addItem("小米电视EA65 2022款 65英寸 金属全面屏 远场语音 逐台校准4K超高清智能教育电视机L65M7-EA",
                "【3月8日巅峰开抢】【到手价不高于2499元，赶快抢购】 【金属全面屏，超高屏占比，4K超高清画质，立体声影院级扬声器】 【65英寸性价比之选点击查看>",
                new String[]{"【65英寸】Redmi A65 4K超高清","【65英寸】E65X 全面屏","【65英寸】EA65 金属全面屏","【65英寸】ES65 画质轻旗舰"});

        addItem("华为智慧屏 SE 55英寸 超薄电视 广色域鸿鹄画质 4K超高清智能液晶电视机 HD55DESA 2+16GB搭载 HarmonyOS 2",
                "【3月7日晚8点开抢】到手价不高于1999元，购机赠全屏影视会员月卡,前100名下单赠价值99元智能台灯，赠完即止【更多推荐】查看>",
                new String[]{"SE系列 畅连通话版","SE系列 标准版"});

        addItem("联想拯救者Y90电竞手机 18GB+640GB 全新骁龙8 霜刃散热 双X轴线性马达 四肩键双压感 144Hz AMOLED电竞屏",
                "【新品上市】预约优惠300，享6期免息，晒单返百元E卡，买赠原厂三件套拯救者Y90保护壳，水凝膜，手游肩键（更多好货）查看>",
                new String[]{"16GB+256GB","12GB+256GB","18GB+640GB"});

        addItem("Apple Watch Series 7 智能手表GPS款41 毫米绿色铝金属表壳苜蓿草色运动型表带 MKN03CH/A",
                "【她的节日，与她同乐】限时抢券享大额优惠，3月4日晚8点-3月8日可用！猛戳！查看>",
                new String[]{"GPS款 41毫米","GPS款 45毫米","GPS+蜂窝款 41毫米","GPS+蜂窝款 45毫米"});

        addItem("Apple AirPods 配无线充电盒 Apple蓝牙耳机 适用iPhone/iPad/Apple Watch",
                "3月4日晚八点起,AirPodsPro抢券+直降,限时限量低至1649元!AirPods现已支持个性定制!查看>",
                new String[]{"H1芯片 有线充电","H1芯片 无线充电","AirPods的无线充电盒","【官方AppleCare+版】有线充电","【官方AppleCare+版】无线充电"});

        addItem("森海塞尔（Sennheiser）Momentum Wireless 大馒头3主动降噪音乐耳机 无线蓝牙头戴式耳机 黑色",
                "【38女神节，限时抢购！】享6期免息！优惠到手仅1799元！古典黑，主动降噪，高品质无线声音，智能免摘通话，奢华皮质耳垫",
                new String[]{"【爆款】HD458 蓝牙降噪","大馒头3蓝牙降噪 白","大馒头3蓝牙降噪 黑"});

        addItem("百诺（Benro）三脚架 IF28+ 单反三脚架佳能尼康相机 可反折转独脚架 超强锁紧 稳定便携云台套装",
                "航空铝脚管+镁合金架专业三轴球形云台反折便携可拆独脚架加强稳定款",
                new String[]{"IF28C+碳纤维反折变独脚","IF18+反折变独脚架","IF28+反折变独脚架"});

        addItem("适马（SIGMA）Art 85mm F1.4 DG HSM 全画幅 大光圈定焦镜头 人像肖像特写（佳能单反卡口）",
                "",
                new String[]{"35/1.2","35/1.4","40/1.4","50/1.4","85/1.4"});

        addItem("【官网认证】苹果无线充电器15W快充MagSafe磁吸iPhone13/12ProMax维肯 【磁吸增强-低温升级版】【限量赠送20W闪充头】 支持苹果13/12/11/pro Max mini",
                "【自营原装】重磅活动直降40元+领神券99减20元，到手仅88，限7-8日抢完即止，再送20W快充头【京东超市】当/次日达【升级版】低温不烫手，磁性加强升级",
                new String[]{"【苹果12/13快充头+USB-C闪充线1米】","【冰磁吸附-双口豪华版】限量送30W氮化镓快充头","【磁吸增强-低温升级版】【限量赠送20W闪充头】"});

        addItem("黑鲨冰封散热背夹2Pro 屏显手机散热器 吃鸡神器 炫彩灯效 适配主流苹果iPhone小米华为荣耀IQOO手机",
                "",
                new String[]{"背夹 标准版","背夹 Pro","背夹2 Pro"});

        addItem("中国联通 5G畅爽冰激凌套餐159元档 40GB+700分钟 老用户套餐变更 话费流量更多",
                "可办2张副卡副卡同主卡速率，当前办理可享受6个月7折优惠，联通5G超快体验，内含5G视频会员包",
                new String[]{"129套餐（30G+500分钟）","159套餐（40G+700分钟）","199套餐（60G+1000分钟）"});

        addItem("中国电信 电信卡无限流量卡全国不限量卡手机卡0月租大王卡上网卡电话卡日租卡电信流量卡",
                "流量卡手机卡电话卡流量卡纯上网电信流量卡中国电信电信卡大王卡流量卡无限量流量无限流量卡手机号上网卡纯流量卡上网卡手机卡流量卡流量卡纯上网纯流量卡5g流量卡电信",
                new String[]{"1张"});

        // 41-60

        addItem("佳能（Canon）EOS 200D II 200D2 迷你单反相机 18-55标准变焦镜头套装 白色 （ 约2410万像素/4K短片）",
                "【迷你单反】轻量设计，打破传统颜色，拥有黑白外观，5轴防抖，流畅自动对焦，轻松视频拍摄。",
                new String[]{"【EOS 200D II】（18-55mm）丨白","【EOS 200D II】（18-55mm）丨黑"});

        addItem("佳能（Canon）EOS 850D 单反相机 18-55标准变焦镜头套装（约2410万像素/轻松体验单反）",
                "【新一代单反】单反相机入门推荐，柔和虚化，高速连拍，眼睛检测自动对焦，4K拍摄，5轴数码防抖！更有无线互联，智能分享！\n",
                new String[]{"【EOS 850D】 单机身","【EOS 850D】（18-55mm）套机"});

        addItem("文曲星A6000+ 电子词典 辞典朗文第四版 应试过级 英语口语 4.3英寸触摸屏\n",
                "",
                new String[]{"A6000+","A1600白","E928"});

        addItem("华为手表智能手表 儿童电话手表 3Pro蓝 定位手表 4G全网通/视频通话/九重定位/小度助手 学生男孩女孩",
                "华为手表智能手表华为儿童手表电话定位手表3pro自营中学生儿童男孩女孩",
                new String[]{"【新品】4Pro星云蓝","【新品】4Pro樱花粉","3Pro极光蓝","3Pro超能版雨林绿","3Pro超能版樱语粉","3Pro星云粉"});

        addItem("狼行者3-4人户外全自动帐篷 户外防水野营帐篷休闲帐篷 墨绿色",
                "",
                new String[]{"墨绿色（帐篷+防潮垫2*1.5m）","蓝色（帐篷+防潮垫2*1.5m）","露营套餐"});

        addItem("牧高笛（MOBIGARDEN）营地手推车 户外露营便携式大容量手推车拉杆车折叠小推车",
                "3月9日0点-3月13日24点全场两件95折，叠券满200享9折更优惠查看更多好物查看>",
                new String[]{"象牙白","夜幕黑"});

        addItem("柯帛（KEBO） 比基尼罩衫女夏季海边度假泳衣外套镂空蕾丝温泉服外搭沙滩防晒衣",
                "网红小姐姐们的选择拍照打卡必备一款哦质量与时尚的结合网红泳衣",
                new String[]{"白色均码(85斤-135斤)","黑色均码(85斤-135斤）"});

        addItem("李宁 LI-NING 长发硅胶防水游泳帽 男女士泳帽",
                "",
                new String[]{"百搭黑色","新款浅蓝色","女神粉色","国潮无上黑色","无缝专业竞技黑","无缝专业竞技白"});

        addItem("【上市品牌】凤凰（Phoenix）智能电动平衡车儿童两轮体感漂移车成人越野车双轮代步车二轮玩具车 特惠价店长推荐",
                "【闪购秒杀】3月4日20点爆款秒杀低至408元起！限量送吹风机/充电宝/防具六件套！活动晒图返20元现在红包！6期免息！部分车子京东八仓发货享受当日达~查看>",
                new String[]{"特惠价店长推荐【发光轮+安全防滑轮+蓝牙+自平衡】","8寸店长推荐【蓝牙+发光轮+自平衡+手提+跑马灯","豪华版白色【发光轮+安全防滑轮+蓝牙+自平衡】","8寸红火焰【蓝牙+自平衡+发光轮+手提+跑马灯】","标准版白色【蓝牙+自平衡+手提+跑马灯】","标准版星空色【蓝牙+自平衡+手提+跑马灯】","8寸冰川蓝【蓝牙+自平衡+手提+发光轮+跑马灯】","标准版火焰色【蓝牙+自平衡+手提+跑马灯】","8寸绿色【蓝牙+自平衡+手提+隧道发光轮+跑马灯】"});

        addItem("领奥品牌电动平衡车儿童成人男女孩智能双轮车体感平行车两轮自平衡车越野款小孩10吋带扶手 K6特惠白54V",
                "【38购物节】爆款限时直降，咨询客服抢补贴券低至659起，咨询客服加送头盔/护具。赠运费险，享6期免息，活动下单升级15天免费试用",
                new String[]{"K6旗舰54V【三控/蓝牙+APP遥控+炫光轮】","K6特惠54V【三控/蓝牙+APP遥控+炫光轮】","K6越野54V【三控/蓝牙+APP遥控+炫光轮"});

        addItem("UCAN/锐克新款足球鞋人造草耐磨楔形AG钉短钉综合训练跑鞋运动鞋 黑色",
                "品牌直营旗舰店",
                new String[]{"35","36","37","38","39","40","41","42","43","44"});

        addItem("adidas阿迪达斯官方方旗店男鞋2022春季新款鞋子运动鞋减震舒适耐磨透气休闲训练健身跑步鞋 H00521/Bounce中底/店长推荐",
                "3.4日晚8点-10点京东三八节！全店每满400减70，满200减20，满300减30，满600减120，满1000-200，新款运动鞋、运动服上新！戳我领券！查看>",
                new String[]{"35","36","37","38","39","40","41","42","43","44"});

        addItem("【家用智能新款】麦瑞克Merach跑步机 家用静音走步折叠运动健身器材 【新款升级】",
                "【京东38节】爆款限时直降！领券下单至高立省500元！另有白条免息运费险，健身教程等福利！点击查看>",
                new String[]{"【新款升级】15.6吋彩屏多功能/62CM跑台","【新款升级】蓝屏多功能/18挡电动坡度","【新款升级】蓝屏单功能/18挡电动坡度"});

        addItem("美国OBDINT 拳击沙袋立式家用不倒翁健身沙包儿童跆拳道散打训练器材 2020健身房款+加厚装甲桶+360°踢腿训练器",
                "30年美国出口品质，厂家直销，为您体魄保驾护航",
                new String[]{"1件 送货上门"});

        addItem(" 威克多VICTOR 胜利纳米7羽毛球拍 经典全面型碳素羽拍单拍",
                "威克多大牌直降经典入门进阶爆款9500D",
                new String[]{"爆款推荐：CHA-9500红色","CHA-9500蓝色","HX-7sp香槟金 纳米7"});

        addItem("斯伯丁spalding篮球7号比赛PU室内外耐磨成人儿童篮球",
                "此商品将于2022-03-12,00点结束闪购特卖，足篮排民俗闪购",
                new String[]{"⭐爆款⭐","金标比赛","3号 儿童"});

        addItem("光威（GW） 光威鱼竿28调台钓竿碳素超轻超硬钓鱼竿手竿湖库休闲综合竿鲢鳙竿鲤鱼杆大物竿",
                "不虚标价！无惧对比！评价10万+，光威正品授权，28调腰力好，手感好，无惧大物，力禽60斤鲟鱼，建议搭配光威鱼线",
                new String[]{"升级二代海纹极5.4米更轻更硬+竿稍+礼包","升级二代海纹极4.5米更轻更硬+竿稍+礼包","升级二代海纹极3.6米更轻更硬+竿稍+礼包"});

        addItem("龙王恨（LOONVA）路亚钳控鱼器套装加长失手绳铝合金多功能钓鱼绑钩钳路亚装备大全",
                "蓝鲫冬钓鲫鱼套餐/15.9元共3包/立即抢购",
                new String[]{"黄色路亚钳","可折叠控鱼器","黄色路亚钳+可折叠控鱼器"});

        addItem(" 欧普照明（OPPLE）浴霸风暖浴霸暖风机浴室取暖器卫生间灯浴霸灯集成吊顶浴霸F135-E",
                "",
                new String[]{"A【经典按键】超宽风口|强劲双核","B【升级触控】超大功率|自动沐浴","C【新品上市】米家智控|三色照明"});

        addItem("青苇 防蚊纱窗门帘130*155cm 4片装 带加宽魔术贴 驱蚊纱帘 自粘式 可剪裁",
                "",
                new String[]{"130*155cm 4片装","130*155cm 2片装","80cm*120cm灰色"});

        addItem("木子西年 北欧小号陶瓷花瓶装饰摆件假花仿真花插花水培花器 客厅餐桌家居装饰品",
                "【家居装饰就选木子西年】【默认韵达丰网速运】【运输破损免费补发】【提供免费贺卡，需要联系客服】【更多好物点击查看】",
                new String[]{"【小号花瓶】绻缱(不含花-高约20厘米)","【中号窄口花瓶】净瓶(不含花-高约25厘米)","【大号花瓶】擎(不含花-高约27厘米)"});

        addItem("琴棋书画十字绣新款线绣八匹马到成功八骏图客厅定制大画3D精准印花自己手工刺绣DIY半成品材料工具包",
                "庆元旦迎新年，年货节大促正在进行！客厅大画推荐",
                new String[]{"十字绣棉线 180*63厘米 非满绣","十字绣棉线 152*53厘米 非满绣","十字绣棉线 240*83厘米 非满绣","十字绣丝线 240*83厘米 非满绣","十字绣棉线 297*103厘米 非满绣","钻石画 120*50厘米 满钻全贴 配2套工具","可定制其他尺寸和图案/购买配套裱框，请联系客服"});

        addItem("炊大皇 炒锅 304不锈钢炒菜锅 不粘锅 平底炒锅 可用不锈钢锅铲 可立盖 燃气煤气灶电磁炉通用",
                "【品质厨具逛炊大皇，专注厨具40年】 【TOP炒锅可用铁铲到手仅109元】 【赠漏勺304不锈钢鸳鸯火锅到手79元】，更多》》",
                new String[]{"蜂窝不粘炒锅外径32cm","小黄鸭ip316L炒锅28CM","小黄鸭ip316L炒锅30CM","小黄鸭ip316L炒锅32CM"});

        addItem("美的（Midea）喆物麦饭石色涂层锅 家用电磁炉煤气灶适用炒菜锅炒锅平底煎锅",
                "【品质国货选美的厨具】22cm口径6L高压锅，6重安全保障、90KPa高压烹煮，美味不等待、304不锈钢基材，加厚复合底，不挑炉灶，燃磁通用！抢购",
                new String[]{"28CM【性价比爆款】金色","30CM【加厚】金色款","34CM【加厚】香槟金色+可立锅盖"});

        addItem("烁室太阳能灯路灯户外LED投光灯室外照明一拖一、一拖二泛光100W工厂车间光感应庭院",
                "",
                new String[]{"55瓦+5米连接线+照明面积约65平方","100瓦+5米延长线+照明面积约75平方","200瓦+5米延长线+照明面积约90平方","400瓦+5米延长线+照明面积约120平方","600瓦+5米延长线+照明面积约140平方","800瓦+5米延长线+照明面积约300平方"});

        addItem("飞利浦(PHILIPS) 璀璨银河LED吸顶灯 客厅书房卧室现代简约灯具",
                "飞利浦灯饰照明，价保30天，买贵退差价，联系客服有优惠",
                new String[]{"银色 115W 含遥控【二代】","银河 90W 含遥控器【一代】","银色 55W 不含遥控【二代】","金色 36W 不含遥控【二代】","银色 36W 不含遥控【二代】","金色 55W 不含遥控【二代】","银河 36W 不含遥控【一代】","金色 115W 含遥控器【二代】"});

        addItem("乐上名都北京装修整体全包半包装修设计效果图家装装修公司新房老房二手房翻新新中式适老装修设计工长施工",
                "京东家装全民造家季，先领券再装修更优惠！更有免单大礼等您来！0元预约装修设计",
                new String[]{"朝阳区"});

        addItem("【JDX梵客装修联名款】13.88万元/80平米拎包智尊全包装修套餐 家装工长设计北京装修 特权定金",
                "",
                new String[]{"定金"});

        addItem("欧普照明（OPPLE） 欧普照明 转化插头 排插电源插座转换器一转多 二个五孔二个USB",
                "【热卖狂欢】满减折扣享不停！快来抢购~~",
                new String[]{"1件"});

        addItem("华麦斯 汽修工具套装家用套筒扳手小车棘轮扳手工具箱专业级五金汽保工具组合套装",
                "战神工具46件套由京东全国七大仓库直发3月7日0时-3月17日0时秒杀价49元、晒图返五元到手价44元、质保三年！豪华工具套装（升级加强版104小件）只需79",
                new String[]{"战神工具升级10件套(升级加强版）","战神工具升级32件套(升级加强版）","战神工具升级46件套(升级加强版）","战神工具升级54件套(升级加强版）","战神工具升级120件套(升级加强版）"});

        addItem(" 尚品宅配 整体橱柜定制 防潮板厨房橱柜门店实拍厨柜定制橱柜简欧 家具全屋定制 预付金 （非商品价格）",
                "【特价疯抢】软装宅配，低至6折，点击查看更多爆款好物，买家具更省钱【咨询客服领大额券】立即点击查看>",
                new String[]{"定金"});

        addItem("索菲亚推拉门衣柜全屋定制 现代简约木质大衣柜卧室家具移门衣橱一门到顶靠墙 整体衣柜三门四门储物柜定做 定制金",
                "【开春报名钜惠】预付315元，到店抵扣3150元，315元秒3平爆款衣柜，1元秒1万抵用金！1元享4488元权益礼包，咨询客服，点击预约量房！查看>",
                new String[]{"定金"});

        addItem("LG木纹地板 PVC石塑片材地板革 仿实木地板 自粘加厚耐磨防滑塑胶地板贴",
                "【标价为1平米】【10平米起售】【整箱发货，物流送货到楼下】B1防火T级耐磨，旧地面改造利器；赠送配套胶贴单独发出；家用软地板点击查看",
                new String[]{"样块【地板看样限两种】","01浅灰橡木纹【环保胶贴铺装】","02淡雅榉木【环保胶贴铺装】","03缅甸柚木【环保胶贴铺装】","04非洲相思木【环保胶贴铺装】"});

        addItem("马可波罗瓷砖 地板砖全抛釉客厅瓷砖 卡帕灰 MH88MS030（按整箱购买）",
                "",
                new String[]{"MH88MS030 卡帕灰单片","活动专用24㎡套餐",""});

        addItem("林氏木业 布艺沙发 客厅北欧双人位沙发网红款 现代布沙发小户型S026",
                "【315品质生活节】林氏木业品质家具12日0点准时开卖！爆款5折起！万元红包送不停，实付满额更有懒人沙发等好礼相送！0元入会领510元大额券！点击查看>",
                new String[]{"【天蓝色】S026左双人","【浅灰色】S026右双人"});

        addItem("良工家具 衣柜 纯实木衣柜四门衣橱橡木推拉门衣柜收纳简约现代北欧卧室家具",
                "30年大厂直销，出口欧盟；环保清漆；主材北美进口FAS级橡木。",
                new String[]{"纯实木四门衣柜原木色","纯实木四门衣柜胡桃色"});

        addItem("天堂伞 雨伞加大加固三折三人大伞晴雨伞全钢十骨大伞男女",
                "",
                new String[]{"暗红","海兰","军绿","藏青","紫罗兰","深紫","黑色"});

        addItem(" 雨花泽 电子温湿度计经典升级日历款 带时间闹钟办公家用室内外温度计高精度温度表",
                "",
                new String[]{"【经典款】黑白色","【微表情新款】简约白","【新款超薄】智能微表情"});

        addItem("睡眠博士（AiSleep）枕芯 记忆枕 全方位蝶形慢回弹颈椎保健护颈枕头",
                "",
                new String[]{"60*35*6/11cm"});

        addItem("春喜梦全棉三件套大学生男女宿舍上下铺床上四件套网红纯棉单人床单被套六件四季通用套装 兔兔的萝卜 全棉三件套(被套+床单+枕套)",
                "【京东快递】急速达；7天无理由退换货送运费险；极速审核闪电退款；",
                new String[]{"吉米乐园","恐龙家族","乐巢","莓喜蓝","梦的点滴","清晨牧场","润润果香"});

        // 61-80

        addItem("商场同款gxgjeans牛仔裤男潮牌秋季新款撞色水洗修身男士韩版休闲长裤 蓝色C",
                "全场直降，无需凑单！更多惊喜活动请点击首页查看，立即抢购吧~点击查看",
                new String[]{"165/S","170/M","175/L","180/XL","185/XXL"});

        addItem("EVISU 21AW 男士钞票达摩标志大M牛仔裤 2EAADM1JE92317CT 牛仔蓝",
                "钞票达摩标志大M牛仔裤",
                new String[]{"165/S","170/M","175/L","180/XL","185/XXL"});

        addItem("上海故事（STORY Of SHANGHAI）真丝丝巾女秋冬季高档围巾桑蚕丝绸休闲披肩",
                "",
                new String[]{"木兰醉露","淡雅牡丹","荷韵悠悠 浅绿","香榭百合 粉蓝","香榭百合 灰粉"});

        addItem("帕森（PARZIN）太阳镜男款偏光驾驶墨镜男士偏光眼镜8009",
                "【品牌秒杀】品牌直营，品质保证！【满100减20/200减30】立即抢购，避免缺货！更多潮流新品^·^",
                new String[]{"银框反光膜天蓝片","枪框渐灰片","金边框G15片","黑框黑灰片"});

        addItem("夏沫帆布鞋女2022春季新款韩版学生百搭经典休闲小恐龙板鞋 卡其色",
                "",
                new String[]{"35","36","37","38","39"});

        addItem("奥古狮登老爹鞋女ins潮时尚新款百搭熊猫鞋松糕底网红运动休闲女鞋 20176灰黑【不加绒】",
                "下单立减【满100减30】【徐璐倾情代言】【售后无忧！品质保障！赠运费险！】更多详情进店查看查看>",
                new String[]{"35","36","37","38","39"});

        addItem("七匹狼男士内裤男抑菌春夏季薄款冰丝平角裤中腰抗菌青中年短裤透气大码裤头",
                "此商品将于2022-03-13,00点结束闪购特卖，七匹狼内衣特卖查看",
                new String[]{"(165/80/M)建议80-100斤","(170/85/L)建议100-120斤","(175/90/XL)建议120-140斤","(180/95/XXL)建议140-160斤","(185/100/3XL)建议160-180斤"});

        addItem("联薇睡衣女夏短袖纯棉休闲卡通七分裤家居服薄款两件套圆领可外穿 M8869树叶",
                "【买家保障】全店下单就送退换无忧，支持7天无理由退换货，放心购，更安心",
                new String[]{"160/M","165/L","170/XL","175/XXL"});

        addItem("【原创设计】Donoratico达衣岩2021春连衣裙(如梦花开狂诗曲之一） 飞蕠卡其",
                "Donoratico达衣岩2021春连衣裙(如梦花开狂诗曲之一）",
                new String[]{"XS","S","M","L","XL"});

        addItem("两三事大翻领衬衫女长袖春装新款女士衬衣时尚拼接 爱神祝福 白色",
                "【3.8限时返场】店铺2件8.5折，新品9折，专区1件6折，叠店铺9.5折/9折券点击查看>",
                new String[]{"XS","S","M","L","XL"});

        addItem("回力儿童棉拖鞋2021冬季新款男女室内防滑中大童保暖包根小孩棉鞋 012403灰色",
                "",
                new String[]{"28-29（内长18cm）","30-31（内长19cm）","32-33（内长20cm）","34-35（内长21cm）","36-37（内长22cm）","38-39（内长23cm）"});

        addItem("特步(XTEP)童鞋棉鞋中大童男童加棉保暖跑鞋33-40码儿童运动鞋",
                "#冬装清仓#丨3.9-3.11丨2件8折3件7折丨入会有礼丨点击凑单专区查看>",
                new String[]{"29","30","31","32","33","34","35","36"});

        addItem("IDX/爱定客/藏龙山 匹克联名款帆布鞋男2021秋季新款休闲鞋 藏龙山【黑白】",
                "领券满100减10、满300减30、满390减50",
                new String[]{"38","39","40","41","42","其他码请联系客服"});

        addItem("HLA海澜之家皮鞋男士系带商务正装质感光面透气舒适办公德比鞋子男HAAPXM3AA90183 黑色",
                "【春尚新】",
                new String[]{"38","39","40","41","42","其他码请联系客服"});

        addItem("CHARLES＆KEITH早春新品CK6-10680924包包女包油画菱格钱包",
                "早春Bubble系列新品鞋包上线，周三上新当日下单买即赠礼品袋；更有热款饼干包回归，快来进店选购吧！点击查看>",
                new String[]{"Coral珊瑚色","Light Pink浅粉色","Dark Green深绿色","Cream奶白色","Black黑色"});

        addItem("MUJI 聚酯纤维平型化妆包 粉米色",
                "",
                new String[]{"长19.5×宽9.5×厚6cm"});

        addItem("罗臣LORSSON机械表 德国手表原装进口腕表黎明Dawn系列 自动商务男士手表钢带腕表",
                "【3.8节大促，下单立减700元，赠原装表带，价保3个月】 【正品专营，德国原装进口，正品保障】 【12期免息，联保2年，京东快递安全快速】",
                new String[]{"Dawn系列 银钢蓝针数字","Dawn系列 间金金针刻度","Dawn系列 银钢蓝针罗马刻度(经典款)","Dawn系列 银钢白针刻度","Dawn系列 银钢黑盘刻度","Dawn系列 银刚蓝针刻度","Dawn系列 银刚金边蓝针","Dawn系列 银钢白针罗马刻度"});

        addItem("卡西欧（CASIO）小闹钟 学生儿童闹铃 卡通创意床头闹表 卧室儿童小夜光闹钟女",
                "黑色方块，经典闹钟。下单即赠闹钟专用碳性电池，送完即止!",
                new String[]{"黑色TQ-140S-1PF"});

        addItem("波斯丹顿男士双肩包男生高中生中学生初中生大学生书包潮流男款出差旅游",
                "春尚新【满150减20元，部分满99减30叠加优惠券】【多仓直发JD现货急速达，正品保障！】查看>",
                new String[]{"【大容量出差包-深灰色】","【大容量出差包-浅灰色】","深灰色A款","深灰色B款","深灰色C款"});

        addItem("七匹狼真皮驾驶证皮套多功能头层牛皮超薄机动车行驶证套二合一驾驶本驾照皮套男士证件套夹包",
                "七匹狼箱包皮具特惠领卷满99减20满200减40满400减60京东中通发货疫情管控区新疆西藏延迟发【点击查看【点击查看】查看>",
                new String[]{"款式一黑色5个透明窗3个卡位 闪电发货","款式二超薄款黑色4个透明窗无卡位"});

        addItem("【双面加绒】童装女童套装三件套金丝绒秋冬装棉衣韩版时尚儿童加厚小女孩衣服洋气运动卫衣裤子潮中大童外套 冬款加绒加厚三件套 紫色",
                "【冬尚新】满168减20,278减40，机不可失",
                new String[]{"110cm","120cm","130cm","140cm","150cm"});

        addItem("童偎童装女童裤子长裤秋装儿童牛仔裤加绒棉裤中大童小女孩学生阔腿裤青少年运动裤春秋冬季款裤子 蓝色春秋款 ",
                "",
                new String[]{"110cm","120cm","130cm","140cm","150cm"});

        addItem("爱玛（AIMA）电动车石墨烯电池超长续航双人轻便代步电动摩托车旗舰新款成人学生外卖智能踏板男女电瓶车",
                "",
                new String[]{"润光黑-60V20A【带靠背】","珍珠白-60V20A【带靠背】","润光黑-60V20A【带尾箱】","珍珠白-60V20A【带尾箱】","青木蓝-60V20A【带靠背】","青木蓝-60V20A【带尾箱】"});

        addItem("Ninebot九号【门店自提】电动摩托车E100 智能电动车电摩成人电瓶车锂电池72V续航100km 到门店选颜色",
                "前后碟刹+支持脚踏+续航100km+锂电池72V",
                new String[]{"请到店购买"});

        addItem("70迈智能行车记录仪1S高清夜视大广角停车监控1080P无线互联WiFi APP互联智能语音迷你隐藏",
                "【关注店铺抽奖】加购收藏享365天以换代修服务 【晒单有礼】晒视频+美图+优评有礼10元红包 【产品优势】1080P高清星光夜视丨24H停车监控",
                new String[]{"1S标配版","1S+16G","套餐二 1S标配+32G卡","M300太空灰 套餐三 标配+32G卡+监控线","套餐四 1S标配+停车监控线","M300太空灰 套餐二 标配+64G卡","套餐五 1S标配+32卡+停车监控线","套餐六 1S标配+64G卡+停车监控线"});

        addItem("复旦申花 无耗材车载空气净化器 针对新车甲醛重污染设计强化版 家用汽车用除烟味雾霾PM2.5",
                "【京东秒杀，直降430元，到手价368元】水洗无耗材随机赠送防滑垫和绑带查看>",
                new String[]{"1件"});

        addItem("道达尔Total 动力高效提升剂120ml 燃油宝燃油清洗剂提高辛烷值 法国进口原液 汽车用品",
                "【道达尔动力提升剂】专业动力提升，强劲动力，有效提升燃油辛烷值，加强抗震爆能力，领优惠券满99-20/199-60/299-100燃动春色，影动精彩查看>",
                new String[]{"经典型7合1燃油高效添加剂","动力高效提升剂","五合一燃油系统高效添加剂","五合一燃油系统高效添加剂2瓶装","日常维护除积碳添加剂"});

        addItem("壳牌（Shell）壳牌润滑油 灰壳超凡喜力 发动机润滑油机油 5W-40 1L",
                "【联系客服领惊喜优惠】壳牌极净一件6折！购买全合成机油4L及以上加10元可换购机油滤芯！马勒、曼牌滤清器低至7折！(此商品不参加上述活动)查看>",
                new String[]{"1L"});

        addItem("定金 BMW宝马 THE 3系 全新BMW3系 汽车整车新车定金",
                "BMW新年工时券活动，低至9.9元抵全部工时！还有指定星型号轮胎限时买4免1！更多活动点击查看>",
                new String[]{"1辆"});

        addItem("上汽大众 威然2020款380TSI尊贵型7座白色SVW65311AV",
                "",
                new String[]{"1辆"});

        addItem("中铁华侨城和园 大兴五环新房房产 125-290㎡全智能精装雅艺大宅 北京新房房产",
                "跨品类大额神券限量发放，618当天使用优惠更多猛戳",
                new String[]{"四室两厅两卫","两室两厅两卫","两室两厅两卫B"});

        addItem("北科建翡翠华庭 订房享6重好礼 价值高达17万元 怀柔新城核心区 5G时代先锋科创公馆 北京新房房产",
                "订房赚17万豪华礼包，了解详情请拨打400电话",
                new String[]{"D东户型","D户型","F户型","E户型","C反户型","C户型","L户型"});

        addItem("北京公交驾校 手动档速成班C1周一至周五时间集中训练学习培训驾校/学车/考驾照 白条分期",
                "2.3月内购来啦",
                new String[]{"不过包退"});

        addItem("中鑫之宝 汽车保养服务 节气门清洗套餐 路虎",
                "",
                new String[]{"奔驰","宝马","路虎","保时捷","奥迪","沃尔沃","捷豹","进口大众"});

        addItem("毕亚兹 车载手机支架 C20 中控台磁吸式 仪表台磁铁吸附支架 炫酷黑 汽车手机支架 手机平板导航仪通用",
                "",
                new String[]{"引磁片【银】","引磁片【黑】","中控台磁吸式支架【炫酷黑】","出风口磁吸支架【土豪金】","磁吸支架玫瑰金【平贴款】"});

        addItem("御马 汽车丝圈脚垫适用于奔驰奥迪A4a6LQ5帕萨特迈腾雅阁凯美瑞宝马X3系卡宴特斯拉model3Y",
                "【新年狂欢，每满200减20，下单立减，上不封顶，领券再减5元】",
                new String[]{"【环保无异味+耐脏+耐磨+易打理】尚御灰黑","【环保无异味+耐脏+耐磨+易打理】尚御马鞍棕","【环保无异味+耐脏+耐磨+易打理】尚御米蓝","【环保无异味+耐脏+耐磨+易打理】尚御紫黑","【环保无异味+耐脏+耐磨+易打理】尚御紫红"});

        addItem("蓝星汽车摩托车玻璃水-30°C 2L 单瓶装 四季通用挡风玻璃清洁剂清洗剂去污剂雨刮精新老包装交替",
                "雨季出行,玻璃驱水,让您的视野更加清晰点击购买(此商品不参加上述活动)查看>",
                new String[]{"一瓶"});

        addItem("龟牌（Turtle Wax）硬壳洗车液高泡沫洗车液洗车水蜡洗车套装汽车清洗剂清洁剂泡沫剂 去污汽车用品TC-75",
                "【龟牌】洗车液优惠券大放送，享受极速物流，樱花清香味儿，泡沫丰富，清洗润滑，清香洗车它在行！查看>",
                new String[]{"一瓶"});

        addItem("趣行 A型三角手动车位锁 加强槽耐压一体成型底座 抗碾轧挂锁式车库挡车器停车地锁 单锁版",
                "【京东仓储】一体冲压成型底座，无焊点坚固耐用，防碾压效果更好 升级增加抗压槽，赠挂锁、安装螺丝、反光条活动专区(此商品不参加上述活动)查看>",
                new String[]{"加强槽一体成型地锁","加强槽双锁一体成型地锁","加厚反光八角车位锁"});

        addItem("野马（YEMA）6623电动车头盔男女士机车安全帽冬季双镜片半盔 四季通用",
                "赛羽新款骑行服，春季上新，畅享安全骑行季！直通车(此商品不参加上述活动)查看>",
                new String[]{"亚黑配防雾镜片","陶瓷白配防雾镜片","粉红配防雾镜片","亮黑配防雾镜片"});

        // 81-100

        // 101-120

        itemList.forEach(item -> itemMapper.insert(item));
        itemMapper.insertInnerItem(innerItemList);
    }

    private void addItem(String title, String subTitle, String[] typeName) {
        ItemCreateParam itemCreateParam = new ItemCreateParam();
        itemCreateParam.setUserId(21979855163752448L);
        itemCreateParam.setTitle(title);
        itemCreateParam.setSubTitle(subTitle);
        itemCreateParam.setH5Base64(null);
        itemCreateParam.setCategoryTwoId(nowId.longValue());
        itemCreateParam.setCategoryOneId(categoryMap.get(nowId.longValue()).getCategoryOneId());
        Item item = new Item(itemCreateParam);
        itemList.add(item);
        Random random = new Random();
        for (String s : typeName) {
            innerItemList.add(new InnerItem(item, new InnerItemCreateParam(s, BigDecimal.valueOf(random.nextInt(1000) + random.nextDouble() % 1), random.nextInt(1000))));
        }

        if (isNext){
            isNext = false;
            nowId++;
        }else {
            isNext = true;
        }
    }
}
